// src/data/materials/fittingCompatibility.ts
export const fittingCompatibility = {

    pipe: {

        materials: [
            'SGP黒EG', 'SGP黒鍛BH', 'SGP白EG', 'SGP白鍛BC', 'SGPW',
            'STPY400',
            'STS370',
            'STPG370S', 'STPG370E', 'STPG410S', 'STPG410E',
            'STPT370S', 'STPT370E', 'STPT410S', 'STPT410E', 'STPT480S', 'STPT480E',
            '金24K', '金18K', '銀Ag', '銅Cu', 'プラチナ', 'チタン', 'アルミ', '鋳鉄', '塩ビPVC', 'PEポリエチレン', 'ダイヤモンド', 'タングステン',
        ],

        jisMap: {
            SGP黒EG: ['G3452'], SGP黒鍛BH: ['G3452'], SGP白EG: ['G3452'], SGP白鍛BC: ['G3452'], SGPW: ['G3442'], STPY400: ['G3457'],
            STPG370S: ['G3454'], STPG370E: ['G3454'], STPG410S: ['G3454'], STPG410E: ['G3454'],
            STPT370S: ['G3456'], STPT370E: ['G3456'], STPT410S: ['G3456'], STPT410E: ['G3456'], STPT480S: ['G3456'], STPT480E: ['G3456'],
            STS370: ['G3455'],
            金24K: ['G3459'], 金18K: ['G3459'], 銀Ag: ['G3459'], 銅Cu: ['G3459'], プラチナ: ['G3459'], チタン: ['G3459'], アルミ: ['G3459'], 鋳鉄: ['G3459'], 塩ビPVC: [], PEポリエチレン: ['G3459'], ダイヤモンド: ['G3459'], タングステン: ['G3459'],
        },
    },

    pipe2: {

        materials: [
            'SUS304TPD', 'SUS304LTPD', 'SUS316TPD', 'SUS316LTPD',
            'SUS304TPA', 'SUS304LTPA', 'SUS316TPA', 'SUS316LTPA',
            'SUS304TP_S_H', 'SUS304TP_S_C', 'SUS304TP_E_H', 'SUS304TP_E_C',
            'SUS304LTP_S_H', 'SUS304LTP_S_C', 'SUS304LTP_E_H', 'SUS304LTP_E_C',
            'SUS316TP_S_H', 'SUS316TP_S_C', 'SUS316TP_E_H', 'SUS316TP_E_C',
            'SUS316LTP_S_H', 'SUS316LTP_S_C', 'SUS316LTP_E_H', 'SUS316LTP_E_C',
            'SUS430', 'SUS410', 'SUS329J4L',
            '金24K', '金18K', '銀Ag', '銅Cu', 'プラチナ', 'チタン', 'アルミ', '鋳鉄', '塩ビPVC', 'PEポリエチレン', 'ダイヤモンド', 'タングステン',
        ],

        jisMap: {
            SUS304TPD: ['G3448'], SUS304LTPD: ['G3448'], SUS316TPD: ['G3448'], SUS316LTPD: ['G3448'],
            SUS304TPA: ['G3448'], SUS304LTPA: ['G3448'], SUS316TPA: ['G3448'], SUS316LTPA: ['G3448'],
            SUS304TP_S_H: ['G3459'], SUS304TP_S_C: ['G3459'], SUS304TP_E_H: ['G3459'], SUS304TP_E_C: ['G3459'],
            SUS304LTP_S_H: ['G3459'], SUS304LTP_S_C: ['G3459'], SUS304LTP_E_H: ['G3459'], SUS304LTP_E_C: ['G3459'],
            SUS316TP_S_H: ['G3459'], SUS316TP_S_C: ['G3459'], SUS316TP_E_H: ['G3459'], SUS316TP_E_C: ['G3459'],
            SUS316LTP_S_H: ['G3459'], SUS316LTP_S_C: ['G3459'], SUS316LTP_E_H: ['G3459'], SUS316LTP_E_C: ['G3459'],
            SUS304TPY: ['G3468'],
            SUS430: ['G3459'], SUS410: ['G3459'], SUS329J4L: ['G3459'],
            金24K: ['G3459'], 金18K: ['G3459'], 銀Ag: ['G3459'], 銅Cu: ['G3459'], プラチナ: ['G3459'], チタン: ['G3459'], アルミ: ['G3459'], 鋳鉄: ['G3459'], 塩ビPVC: [], PEポリエチレン: ['G3459'], ダイヤモンド: ['G3459'], タングステン: ['G3459'],
        },
    },

    elbow: {
        materials: [
            'SGP_黒', 'SGP_白', '可鍛鋳鉄_黒', '可鍛鋳鉄_白', 'PG370', 'PT370',

            'SUS304', 'SUS304L', 'SUS316', 'SUS316L', 'SUS304TPD',

            'SUS304_PT', 'SUS304L_PT', 'SUS316_PT', 'SUS316L_PT',

            'SUS430', 'SUS410', 'SUS329J4L',

            '金24K', '金18K', '銀Ag', '銅Cu', 'プラチナ', 'チタン', 'アルミ', '鋳鉄', '塩ビPVC', 'PEポリエチレン', 'ダイヤモンド', 'タングステン',
        ],
        jisMap: {
            SGP_黒: ['B2311'], SGP_白: ['B2311'], 可鍛鋳鉄_黒: [''], 可鍛鋳鉄_白: [''], PG370: ['B2312'], PT370: ['B2312'],

            SUS304: ['B2312'], SUS304L: ['B2312'], SUS316: ['B2312'], SUS316L: ['B2312'], SUS304TPD: ['G3448'],

            SUS304_PT: [''], SUS304L_PT: [''], SUS316_PT: [''], SUS316L_PT: [''],

            SUS430: ['B2312'], SUS410: ['B2312'], SUS329J4L: ['B2312'],

            金24K: ['B2312'], 金18K: ['B2312'], 銀Ag: ['B2312'], 銅Cu: ['B2312'], プラチナ: ['B2312'], チタン: ['B2312'], アルミ: ['B2312'], 鋳鉄: ['B2312'], 塩ビPVC: [], PEポリエチレン: ['B2312'], ダイヤモンド: ['B2312'], タングステン: ['B2312'],
        },
    },

    shortelbow: {

        materials: [
            'SGP_黒', 'SGP_白', '可鍛鋳鉄_黒', '可鍛鋳鉄_白', 'PG370', 'PT370',

            'SUS304', 'SUS304L', 'SUS316', 'SUS316L', 'SUS304TPD',

            'SUS304_PT', 'SUS304L_PT', 'SUS316_PT', 'SUS316L_PT',

            'SUS430', 'SUS410', 'SUS329J4L',

            '金24K', '金18K', '銀Ag', '銅Cu', 'プラチナ', 'チタン', 'アルミ', '鋳鉄', '塩ビPVC', 'PEポリエチレン', 'ダイヤモンド', 'タングステン',
        ],
        jisMap: {
            SGP_黒: ['B2311'], SGP_白: ['B2311'], 可鍛鋳鉄_黒: [''], 可鍛鋳鉄_白: [''], PG370: ['B2312'], PT370: ['B2312'],

            SUS304: ['B2312'], SUS304L: ['B2312'], SUS316: ['B2312'], SUS316L: ['B2312'], SUS304TPD: ['G3448'],

            SUS304_PT: [''], SUS304L_PT: [''], SUS316_PT: [''], SUS316L_PT: [''],

            SUS430: ['B2312'], SUS410: ['B2312'], SUS329J4L: ['B2312'],

            金24K: ['B2312'], 金18K: ['B2312'], 銀Ag: ['B2312'], 銅Cu: ['B2312'], プラチナ: ['B2312'], チタン: ['B2312'], アルミ: ['B2312'], 鋳鉄: ['B2312'], 塩ビPVC: [], PEポリエチレン: ['B2312'], ダイヤモンド: ['B2312'], タングステン: ['B2312'],
        },
    },



    tee: {
        materials: [
            'SGP_黒', 'SGP_白', '可鍛鋳鉄_黒', '可鍛鋳鉄_白', 'PG370', 'PT370',

            'SUS304', 'SUS304L', 'SUS316', 'SUS316L', 'SUS304TPD',

            'SUS304_PT', 'SUS304L_PT', 'SUS316_PT', 'SUS316L_PT',

            'SUS430', 'SUS410', 'SUS329J4L',

            '金24K', '金18K', '銀Ag', '銅Cu', 'プラチナ', 'チタン', 'アルミ', '鋳鉄', '塩ビPVC', 'PEポリエチレン', 'ダイヤモンド', 'タングステン',
        ],
        jisMap: {

            SGP_黒: ['B2311_T'], SGP_白: ['B2311_T'], 可鍛鋳鉄_黒: [''], 可鍛鋳鉄_白: [''], PG370: ['B2312_T'], ST370: ['B2312_T'],

            SUS304: ['B2312_T'], SUS304L: ['B2312_T'], SUS316: ['B2312_T'], SUS316L: ['B2312_T'], SUS304TPD: ['G3448'],

            SUS304_PT: [''], SUS304L_PT: [''], SUS316_PT: [''], SUS316L_PT: [''],

            SUS430: ['B2312_T'], SUS410: ['B2312_T'], SUS329J4L: ['B2312_T'],

            金24K: ['B2312_T'], 金18K: ['B2312_T'], 銀Ag: ['B2312_T'], 銅Cu: ['B2312_T'], プラチナ: ['B2312_T'], チタン: ['B2312_T'], アルミ: ['B2312_T'], 鋳鉄: ['B2312_T'], 塩ビPVC: [], PEポリエチレン: ['B2312_T'], ダイヤモンド: ['B2312_T'], タングステン: ['B2312_T'],
        },
    },

    tee_reducing: {
        materials: [
            'SGP_黒', 'SGP_白', '可鍛鋳鉄_黒', '可鍛鋳鉄_白', 'PG370', 'PT370',

            'SUS304', 'SUS304L', 'SUS316', 'SUS316L', 'SUS304TPD',

            'SUS304_PT', 'SUS304L_PT', 'SUS316_PT', 'SUS316L_PT',

            'SUS430', 'SUS410', 'SUS329J4L',

            '金24K', '金18K', '銀Ag', '銅Cu', 'プラチナ', 'チタン', 'アルミ', '鋳鉄', '塩ビPVC', 'PEポリエチレン', 'ダイヤモンド', 'タングステン',
        ],
        jisMap: {
            SGP_黒: [''], SGP_白: [''], 可鍛鋳鉄_黒: [''], 可鍛鋳鉄_白: [''], PG370: ['B2312_TR'], ST370: ['B2312_TR'],

            SUS304: ['B2312_TR'], SUS304L: ['B2312_TR'], SUS316: ['B2312_TR'], SUS316L: ['B2312_TR'], SUS304TPD: [''],

            SUS304_PT: [''], SUS304L_PT: [''], SUS316_PT: [''], SUS316L_PT: [''],

            SUS430: ['B2312_TR'], SUS410: ['B2312_TR'], SUS329J4L: ['B2312_TR'],

            金24K: ['B2312_TR'], 金18K: ['B2312_TR'], 銀Ag: ['B2312_TR'], 銅Cu: ['B2312_TR'], プラチナ: ['B2312_TR'], チタン: ['B2312_TR'], アルミ: ['B2312_TR'], 鋳鉄: ['B2312_TR'], 塩ビPVC: [], PEポリエチレン: ['B2312_TR'], ダイヤモンド: ['B2312_TR'], タングステン: ['B2312_TR'],
        },
    },

    halfelbow: {
        materials: [
            'SGP_黒', 'SGP_白', '可鍛鋳鉄_黒', '可鍛鋳鉄_白', 'PG370', 'PT370',

            'SUS304', 'SUS304L', 'SUS316', 'SUS316L', 'SUS304TPD',

            'SUS304_PT', 'SUS304L_PT', 'SUS316_PT', 'SUS316L_PT',

            'SUS430', 'SUS410', 'SUS329J4L',

            '金24K', '金18K', '銀Ag', '銅Cu', 'プラチナ', 'チタン', 'アルミ', '鋳鉄', '塩ビPVC', 'PEポリエチレン', 'ダイヤモンド', 'タングステン',
        ],
        jisMap: {
            SGP_黒: ['B2311'], SGP_白: ['B2311'], 可鍛鋳鉄_黒: [''], 可鍛鋳鉄_白: [''], PG370: ['B2312'], PT370: ['B2312'],

            SUS304: ['B2312'], SUS304L: ['B2312'], SUS316: ['B2312'], SUS316L: ['B2312'], SUS304TPD: ['G3448'],

            SUS304_PT: [''], SUS304L_PT: [''], SUS316_PT: [''], SUS316L_PT: [''],

            SUS430: ['B2312'], SUS410: ['B2312'], SUS329J4L: ['B2312'],

            金24K: ['B2312'], 金18K: ['B2312'], 銀Ag: ['B2312'], 銅Cu: ['B2312'], プラチナ: ['B2312'], チタン: ['B2312'], アルミ: ['B2312'], 鋳鉄: ['B2312'], 塩ビPVC: [], PEポリエチレン: ['B2312'], ダイヤモンド: ['B2312'], タングステン: ['B2312'],
        },
    },

    halfshortelbow: {
        materials: [
            'SGP_黒', 'SGP_白', 'PG370', 'PT370',

            'SUS304', 'SUS304L', 'SUS316', 'SUS316L', 'SUS304TPD',

            'SUS430', 'SUS410', 'SUS329J4L',

            '金24K', '金18K', '銀Ag', '銅Cu', 'プラチナ', 'チタン', 'アルミ', '鋳鉄', '塩ビPVC', 'PEポリエチレン', 'ダイヤモンド', 'タングステン',
        ],
        jisMap: {
            SGP_黒: ['B2311'], SGP_白: ['B2311'], 可鍛鋳鉄_黒: [''], 可鍛鋳鉄_白: [''], PG370: ['B2312'], PT370: ['B2312'],

            SUS304: ['B2312'], SUS304L: ['B2312'], SUS316: ['B2312'], SUS316L: ['B2312'], SUS304TPD: ['G3448'],

            SUS430: ['B2312'], SUS410: ['B2312'], SUS329J4L: ['B2312'],

            金24K: ['B2312'], 金18K: ['B2312'], 銀Ag: ['B2312'], 銅Cu: ['B2312'], プラチナ: ['B2312'], チタン: ['B2312'], アルミ: ['B2312'], 鋳鉄: ['B2312'], 塩ビPVC: [], PEポリエチレン: ['B2312'], ダイヤモンド: ['B2312'], タングステン: ['B2312'],
        },
    },



    reducer: {
        materials: [
            'SGP_黒', 'SGP_白', '可鍛鋳鉄_黒', '可鍛鋳鉄_白', 'PG370', 'PT370',

            'SUS304', 'SUS304L', 'SUS316', 'SUS316L', 'SUS304TPD',

            'SUS304_PT', 'SUS304L_PT', 'SUS316_PT', 'SUS316L_PT',

            'SUS430', 'SUS410', 'SUS329J4L',

            '金24K', '金18K', '銀Ag', '銅Cu', 'プラチナ', 'チタン', 'アルミ', '鋳鉄', '塩ビPVC', 'PEポリエチレン', 'ダイヤモンド', 'タングステン',
        ],

        jisMap: {
            SGP_黒: [''], SGP_白: [''], 可鍛鋳鉄_黒: [''], 可鍛鋳鉄_白: [''], PG370: ['B2312_R'], PT370: ['B2312_R'],

            SUS304: ['B2312_R'], SUS304L: ['B2312_R'], SUS316: ['B2312_R'], SUS316L: ['B2312_R'], SUS304TPD: ['G3448'],

            SUS304_PT: [''], SUS304L_PT: [''], SUS316_PT: [''], SUS316L_PT: [''],

            SUS430: ['B2312_R'], SUS410: ['B2312_R'], SUS329J4L: ['B2312_R'],

            金24K: ['B2312_R'], 金18K: ['B2312_R'], 銀Ag: ['B2312_R'], 銅Cu: ['B2312_R'], プラチナ: ['B2312_R'], チタン: ['B2312_R'], アルミ: ['B2312_R'], 鋳鉄: ['B2312_R'], 塩ビPVC: [], PEポリエチレン: ['B2312_R'], ダイヤモンド: ['B2312_R'], タングステン: ['B2312_R'],
        },

    },

    flat_flange: {
        materials: [
            'SS400',

            'SUS304', 'SUS304L', 'SUS316', 'SUS316L',

            'SUS304_PT', 'SUS304L_PT', 'SUS316_PT', 'SUS316L_PT',

            '金24K', '金18K', '銀Ag', '銅Cu', 'プラチナ', 'チタン', 'アルミ', '鋳鉄', '塩ビPVC', 'PEポリエチレン', 'ダイヤモンド', 'タングステン',
        ],
        jisMap: {
            SS400: ['B2220_FF'],

            SUS304: ['B2220_FF'], SUS304L: ['B2220_FF'], SUS316: ['B2220_FF'], SUS316L: ['B2220_FF'],

            SUS304_PT: [''], SUS304L_PT: [''], SUS316_PT: [''], SUS316L_PT: [''],

            金24K: ['B2220_FF'], 金18K: ['B2220_FF'], 銀Ag: ['B2220_FF'], 銅Cu: ['B2220_FF'], プラチナ: ['B2220_FF'], チタン: ['B2220_FF'], アルミ: ['B2220_FF'], 鋳鉄: ['B2220_FF'], 塩ビPVC: [], PEポリエチレン: ['B2220_FF'], ダイヤモンド: ['B2220_FF'], タングステン: ['B2220_FF'],
        },
    },

    BL_flat_flange: {
        materials: [
            'SS400',

            'SUS304', 'SUS304L', 'SUS316', 'SUS316L',

            '金24K', '金18K', '銀Ag', '銅Cu', 'プラチナ', 'チタン', 'アルミ', '鋳鉄', '塩ビPVC', 'PEポリエチレン', 'ダイヤモンド', 'タングステン',
        ],
        jisMap: {

            SS400: ['B2220_FFBL'],

            SUS304: ['B2220_FFBL'], SUS304L: ['B2220_FFBL'], SUS316: ['B2220_FFBL'], SUS316L: ['B2220_FFBL'], SUS304TPD: [''],

            金24K: ['B2220_FFBL'], 金18K: ['B2220_FFBL'], 銀Ag: ['B2220_FFBL'], 銅Cu: ['B2220_FFBL'], プラチナ: ['B2220_FFBL'], チタン: ['B2220_FFBL'], アルミ: ['B2220_FFBL'], 鋳鉄: ['B2220_FFBL'], 塩ビPVC: [], PEポリエチレン: ['B2220_FFBL'], ダイヤモンド: ['B2220_FFBL'], タングステン: ['B2220_FFBL'],
        },
    },

    Flat_Bar: {
        materials: [
            'SS400',
            'SUS304', 'SUS304L', 'SUS316', 'SUS316L',
            '金24K', '金18K', '銀Ag', '銅Cu', 'プラチナ', 'チタン', 'アルミ', '鋳鉄', '塩ビPVC', 'PEポリエチレン', 'ダイヤモンド', 'タングステン',
        ],
        jisMap: {
            SS400: ['G3194'],
            SUS304: ['G3194'], SUS304L: ['G3194'], SUS316: ['G3194'], SUS316L: ['G3194'],
            金24K: ['G3194'], 金18K: ['G3194'], 銀Ag: ['G3194'], 銅Cu: ['G3194'], プラチナ: ['G3194'], チタン: ['G3194'],
            アルミ: ['G3194'], 鋳鉄: ['G3194'], PEポリエチレン: ['G3194'], タングステン: ['G3194'],
        },
    },


    Angle: {
        materials: [
            'SS400',
            'SUS304', 'SUS304L', 'SUS316', 'SUS316L',
            '金24K', '金18K', '銀Ag', '銅Cu', 'プラチナ', 'チタン', 'アルミ', '鋳鉄', '塩ビPVC', 'PEポリエチレン', 'ダイヤモンド', 'タングステン',
        ],
        jisMap: {
            SS400: ['G3192_L'],
            SUS304: ['G3192_L'], SUS304L: ['G3192_L'], SUS316: ['G3192_L'], SUS316L: ['G3192_L'],
            金24K: ['G3192_L'], 金18K: ['G3192_L'], 銀Ag: ['G3192_L'], 銅Cu: ['G3192_L'], プラチナ: ['G3192_L'], チタン: ['G3192_L'],
            アルミ: ['G3192_L'], 鋳鉄: ['G3192_L'], PEポリエチレン: ['G3192_L'], タングステン: ['G3192_L'],
        },
    },

    Channel: {
        materials: [
            'SS400',
            'SUS304', 'SUS304L', 'SUS316', 'SUS316L',
            '金24K', '金18K', '銀Ag', '銅Cu', 'プラチナ', 'チタン', 'アルミ', '鋳鉄', '塩ビPVC', 'PEポリエチレン', 'ダイヤモンド', 'タングステン',
        ],
        jisMap: {
            SS400: ['G3192_C'],
            SUS304: ['G3192_C'], SUS304L: ['G3192_C'], SUS316: ['G3192_C'], SUS316L: ['G3192_C'],
            金24K: ['G3192_C'], 金18K: ['G3192_C'], 銀Ag: ['G3192_C'], 銅Cu: ['G3192_C'], プラチナ: ['G3192_C'], チタン: ['G3192_C'],
            アルミ: ['G3192_C'], 鋳鉄: ['G3192_C'], PEポリエチレン: ['G3192_C'], タングステン: ['G3192_C'],
        },
    },

    H_Beam: {
        materials: [
            'SS400',
            'SUS304', 'SUS304L', 'SUS316', 'SUS316L',
            '金24K', '金18K', '銀Ag', '銅Cu', 'プラチナ', 'チタン', 'アルミ', '鋳鉄', '塩ビPVC', 'PEポリエチレン', 'ダイヤモンド', 'タングステン',
        ],
        jisMap: {
            SS400: ['G3192_H'],
            SUS304: ['G3192_H'], SUS304L: ['G3192_H'], SUS316: ['G3192_H'], SUS316L: ['G3192_H'],
            金24K: ['G3192_H'], 金18K: ['G3192_H'], 銀Ag: ['G3192_H'], 銅Cu: ['G3192_H'], プラチナ: ['G3192_H'], チタン: ['G3192_H'],
            アルミ: ['G3192_H'], 鋳鉄: ['G3192_H'], PEポリエチレン: ['G3192_H'], タングステン: ['G3192_H'],
        },
    },

    Round_Bar: {
        materials: [
            'SS400',
            'SUS304', 'SUS304L', 'SUS316', 'SUS316L',
            '金24K', '金18K', '銀Ag', '銅Cu', 'プラチナ', 'チタン', 'アルミ', '鋳鉄', '塩ビPVC', 'PEポリエチレン', 'ダイヤモンド', 'タングステン',
        ],
        jisMap: {
            SS400: ['G3192_R'],
            SUS304: ['G3192_R'], SUS304L: ['G3192_R'], SUS316: ['G3192_R'], SUS316L: ['G3192_R'],
            金24K: ['G3192_R'], 金18K: ['G3192_R'], 銀Ag: ['G3192_R'], 銅Cu: ['G3192_R'], プラチナ: ['G3192_R'], チタン: ['G3192_R'],
            アルミ: ['G3192_R'], 鋳鉄: ['G3192_R'], PEポリエチレン: ['G3192_R'], タングステン: ['G3192_R'],
        },
    },

    ABS_Angle: {
        materials: [
            'SS400',
            'SUS304', 'SUS304L', 'SUS316', 'SUS316L',
            '金24K', '金18K', '銀Ag', '銅Cu', 'プラチナ', 'チタン', 'アルミ', '鋳鉄', '塩ビPVC', 'PEポリエチレン', 'ダイヤモンド', 'タングステン',
        ],
        jisMap: {
            SS400: ['G3192_ABS'],
            SUS304: ['G3192_ABS'], SUS304L: ['G3192_ABS'], SUS316: ['G3192_ABS'], SUS316L: ['G3192_ABS'],
            金24K: ['G3192_ABS'], 金18K: ['G3192_ABS'], 銀Ag: ['G3192_ABS'], 銅Cu: ['G3192_ABS'], プラチナ: ['G3192_ABS'], チタン: ['G3192_ABS'],
            アルミ: ['G3192_ABS'], 鋳鉄: ['G3192_ABS'], PEポリエチレン: ['G3192_ABS'], タングステン: ['G3192_ABS'],
        },
    },
    PCF_Channel: {
        materials: [
            'SS400',
            'SUS304', 'SUS304L', 'SUS316', 'SUS316L',
            '金24K', '金18K', '銀Ag', '銅Cu', 'プラチナ', 'チタン', 'アルミ', '鋳鉄', '塩ビPVC', 'PEポリエチレン', 'ダイヤモンド', 'タングステン',
        ],
        jisMap: {
            SS400: ['G3192_PCF'],
            SUS304: ['G3192_PCF'], SUS304L: ['G3192_PCF'], SUS316: ['G3192_PCF'], SUS316L: ['G3192_PCF'],
            金24K: ['G3192_PCF'], 金18K: ['G3192_PCF'], 銀Ag: ['G3192_PCF'], 銅Cu: ['G3192_PCF'], プラチナ: ['G3192_PCF'], チタン: ['G3192_PCF'],
            アルミ: ['G3192_PCF'], 鋳鉄: ['G3192_PCF'], PEポリエチレン: ['G3192_PCF'], タングステン: ['G3192_PCF'],
        },
    },

    Ball_Valve_TOYO: {
        materials: [
            'ダクタイル鋳鉄', 'SUS304', 'SUS316',
        ],
        jisMap: {
            ダクタイル鋳鉄: ['10-DBF-N-L レバー式', '10-DBF-N-G ギア式'], SUS304: [''], SUS316: [''],
        },
        
    },















};
